---
kind: property
id: P:Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.Station
source: html/1558579e-cdee-03ca-58b1-5630fe0fa0c1.htm
---
# Autodesk.Revit.DB.Infrastructure.AlignmentStationLabel.Station Property

The alignment station at which the SpotDimension is placed.

## Syntax (C#)
```csharp
public double Station { get; set; }
```